app/controllers/api/v1/posts_controller.rb

            def index
                @posts= Post.order('created_at DESC')
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

            def create
                @post = @user.post.new(post_params)
                if @post.save
---
INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "ihiihihoih"], ["user_id", 8], ["created_at", "2018-08-18 22:12:01.264942"], ["updated_at", "2018-08-18 22:12:01.264942"]]