app/controllers/api/v1/users_controller.rb

def create

    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "token") VALUES (?, ?, ?, ?)  [["name", "testuser"], ["created_at", "2018-08-18 21:08:43.623469"], ["updated_at", "2018-08-18 21:08:43.623469"], ["token", "ad4b241f8acc67f2ccc5ddc8e2745338"]]